; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v6 ?v11)
             (pred_12 ?v5 ?v4)
             (pred_7 ?v6 ?v4)
             (pred_3 ?v2 ?v6 )
	     (pred_4 ?v6)
             (pred_9 ?v12)
             (pred_1 ?v5)
             (pred_2 ?v4)
             (pred_11 ?v6)
             (pred_6 ?v5)
             (pred_8 ?v6)
             (pred_5 ))



(:action op_4
:parameters (?v13 ?v8 ?v10 ?v9)
:precondition (and (pred_9 ?v13) (pred_9 ?v8) (pred_1 ?v10) (pred_2 ?v9)
          (pred_10 ?v13 ?v8) (pred_12 ?v10 ?v9)
                   (pred_7 ?v8 ?v9) (pred_4 ?v13) 
                   (pred_11 ?v8) (pred_6 ?v10))
:effect (and  (pred_8 ?v8) (not (pred_11 ?v8))))


(:action op_3
:parameters (?v13 ?v3)
:precondition (and (pred_9 ?v13) (pred_9 ?v3)
               (pred_4 ?v13) (pred_10 ?v13 ?v3) (pred_8 ?v3))
:effect (and (pred_4 ?v3) (not (pred_4 ?v13))))

(:action op_5
:parameters (?v13 ?v10)
:precondition (and (pred_9 ?v13) (pred_1 ?v10) 
                  (pred_4 ?v13) (pred_3 ?v10 ?v13) (pred_5 ))
:effect (and (pred_6 ?v10)
   (not (pred_3 ?v10 ?v13)) (not (pred_5 ))))


(:action op_2
:parameters (?v13 ?v7 ?v1)
:precondition (and (pred_9 ?v13) (pred_1 ?v7) (pred_1 ?v1)
                  (pred_4 ?v13) (pred_6 ?v1) (pred_3 ?v7 ?v13))
:effect (and (pred_6 ?v7) (pred_3 ?v1 ?v13)
        (not (pred_6 ?v1)) (not (pred_3 ?v7 ?v13))))

(:action op_1
:parameters (?v13 ?v10)
:precondition (and (pred_9 ?v13) (pred_1 ?v10) 
                  (pred_4 ?v13) (pred_6 ?v10))
:effect (and (pred_5 ) (pred_3 ?v10 ?v13) (not (pred_6 ?v10)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_11 obj_19 obj_16 obj_12 obj_04 obj_06 obj_13 obj_10 obj_07 obj_02 obj_15 obj_08 obj_05 obj_01 obj_17 obj_18
    obj_20 obj_03
    obj_14 obj_09
    )

    (:init
       (pred_5)

       (pred_9 obj_11)
       (pred_9 obj_19)
       (pred_9 obj_16)
       (pred_9 obj_12)
       (pred_9 obj_04)
       (pred_9 obj_06)
       (pred_9 obj_13)
       (pred_9 obj_10)
       (pred_9 obj_07)
       (pred_9 obj_02)
       (pred_9 obj_15)
       (pred_9 obj_08)
       (pred_9 obj_05)
       (pred_9 obj_01)
       (pred_9 obj_17)
       (pred_9 obj_18)
       (pred_2 obj_20)
       (pred_2 obj_03)
       (pred_1 obj_14)
       (pred_1 obj_09)

       (pred_10 obj_11 obj_04)
       (pred_10 obj_11 obj_19)
       (pred_10 obj_19 obj_06)
       (pred_10 obj_19 obj_16)
       (pred_10 obj_19 obj_11)
       (pred_10 obj_16 obj_13)
       (pred_10 obj_16 obj_12)
       (pred_10 obj_16 obj_19)
       (pred_10 obj_12 obj_10)
       (pred_10 obj_12 obj_16)
       (pred_10 obj_04 obj_07)
       (pred_10 obj_04 obj_06)
       (pred_10 obj_04 obj_11)
       (pred_10 obj_06 obj_02)
       (pred_10 obj_06 obj_13)
       (pred_10 obj_06 obj_19)
       (pred_10 obj_06 obj_04)
       (pred_10 obj_13 obj_15)
       (pred_10 obj_13 obj_10)
       (pred_10 obj_13 obj_16)
       (pred_10 obj_13 obj_06)
       (pred_10 obj_10 obj_08)
       (pred_10 obj_10 obj_12)
       (pred_10 obj_10 obj_13)
       (pred_10 obj_07 obj_05)
       (pred_10 obj_07 obj_02)
       (pred_10 obj_07 obj_04)
       (pred_10 obj_02 obj_01)
       (pred_10 obj_02 obj_15)
       (pred_10 obj_02 obj_06)
       (pred_10 obj_02 obj_07)
       (pred_10 obj_15 obj_17)
       (pred_10 obj_15 obj_08)
       (pred_10 obj_15 obj_13)
       (pred_10 obj_15 obj_02)
       (pred_10 obj_08 obj_18)
       (pred_10 obj_08 obj_10)
       (pred_10 obj_08 obj_15)
       (pred_10 obj_05 obj_01)
       (pred_10 obj_05 obj_07)
       (pred_10 obj_01 obj_17)
       (pred_10 obj_01 obj_02)
       (pred_10 obj_01 obj_05)
       (pred_10 obj_17 obj_18)
       (pred_10 obj_17 obj_15)
       (pred_10 obj_17 obj_01)
       (pred_10 obj_18 obj_08)
       (pred_10 obj_18 obj_17)
       (pred_11 obj_15)
       (pred_11 obj_19)
       (pred_7  obj_15 obj_20)
       (pred_7  obj_19 obj_03)
       (pred_8 obj_11)
       (pred_8 obj_16)
       (pred_8 obj_12)
       (pred_8 obj_04)
       (pred_8 obj_06)
       (pred_8 obj_13)
       (pred_8 obj_10)
       (pred_8 obj_07)
       (pred_8 obj_02)
       (pred_8 obj_08)
       (pred_8 obj_05)
       (pred_8 obj_01)
       (pred_8 obj_17)
       (pred_8 obj_18)

       (pred_12  obj_14 obj_20)
       (pred_12  obj_09 obj_03)
       (pred_3 obj_14 obj_06)
       (pred_3 obj_09 obj_12)
       (pred_4 obj_02)
    )

    (:goal (and
       (pred_3 obj_09 obj_11)
    ))
(:constraints
  (always (not (pred_4 obj_16)))
)
)

; plan
1. (op_3 obj_02 obj_06)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_06)
   goals met: 0 of 1
2. (op_3 obj_06 obj_13)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_13)
   goals met: 0 of 1
3. (op_3 obj_13 obj_10)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_10)
   goals met: 0 of 1
4. (op_3 obj_10 obj_12)
   deleted: (pred_4 obj_10)
   added: (pred_4 obj_12)
   goals met: 0 of 1
5. (op_5 obj_12 obj_09)
   deleted: (pred_3 obj_09 obj_12) (pred_5)
   added: (pred_6 obj_09)
   goals met: 0 of 1
6. (op_3 obj_12 obj_10)
   deleted: (pred_4 obj_12)
   added: (pred_4 obj_10)
   goals met: 0 of 1
7. (op_3 obj_10 obj_13)
   deleted: (pred_4 obj_10)
   added: (pred_4 obj_13)
   goals met: 0 of 1
8. (op_3 obj_13 obj_06)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_06)
   goals met: 0 of 1
9. (op_3 obj_06 obj_04)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_04)
   goals met: 0 of 1
10. (op_3 obj_04 obj_11)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_11)
   goals met: 0 of 1
11. (op_1 obj_11 obj_09)
   deleted: (pred_6 obj_09)
   added: (pred_5) (pred_3 obj_09 obj_11)
   goals met: 1 of 1
